app/controllers/films_controller.rb

SELECT "films".* FROM "films"  WHERE "films"."location_id" = 1
SELECT "films".* FROM "films"  WHERE (title like '%Alexander's Ragtime Band(San Francisco Bay, CA)%')
SELECT "films".* FROM "films"
---
  def index
    location_id = params[:location_id]
    filter_key = params[:query]
    if location_id
      @films = Film.where(location: location_id)
    elsif filter_key
      @films = Film.where("title like '%#{filter_key}%'")
    else
      @films = Film.all

SELECT  "films".* FROM "films"  WHERE "films"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_film
    @film = Film.find(params[:id])