app/controllers/locations_controller.rb

  def index
    bounds = location_params[:bounds]
    if bounds
      @locations = nearby
    else
      @locations = Location.all
---
SELECT "locations".* FROM "locations"  WHERE (lat > 37.755042 and lat < 37.762558 and lng > -122.426022 and lng < -122.403427)