app/controllers/sanpix_controller.rb

  def init
    loader = DataLoader.new
    geocoder = GeoCoder.new
    counter = loader.load(200) do |item|
      begin
        coord = geocoder.encode(item[:address])
        existing_location = Location.where(lat: coord["lat"], lng: coord["lng"]).first
        if (not existing_location)
          existing_location = Location.new(item.slice(:address))
          existing_location.save
        end

        Rails.logger.info existing_location

        film = Film.new(item.except(:address))
        film.location_id = existing_location.id
        film.save
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."lat" = 48.016389 AND "locations"."lng" = 8.032499999999999  ORDER BY "locations"."id" ASC LIMIT 1
INSERT INTO "locations" ("address", "created_at", "lat", "lng", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "20th and Folsom Streets, CA"], ["created_at", "2014-08-16 22:20:57.119978"], ["lat", 37.758895], ["lng", -122.4147242], ["updated_at", "2014-08-16 22:20:57.119978"]]
INSERT INTO "films" ("created_at", "lat", "lng", "location", "release_year", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)